uhnp/src/InformationRegisters/ВидыПодтверждающихДокументовПоВидамОперацийУХ/ВидыПодтверждающихДокументовПоВидамОперацийУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВидыПодтверждающихДокументовПоВидамОперацийУХ</name>
  <resources>
    <name>Обязателен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПодтверждающегоДокумента</name>
    <type>
      <types>CatalogRef.ВидыПодтверждающихДокументовУХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы/ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыПодтверждающихДокументовУХ/ВидыПодтверждающихДокументовУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПодтверждающихДокументовУХ</name>
  <predefined>
    <items>
      <name>ПроизвольныйФайл</name>
      <description>Произвольный файл</description>
    </items>
  </predefined>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/ПодтверждающиеДокументыУХ/Module.bsl
#Область  ПрограммныйИнтерфейс

// Функция - Тип ограничения документа базы
//
// Параметры:
//  ВидДокумента - Строка	 - вид документа
// 
// Возвращаемое значение:
//   Массив - массив типов ограничений
//
Функция ТипОграниченияДокументаБазы(ВидДокумента) Экспорт
			
	ТипОграничения 	= Новый Массив;
	ИмяДанных 		= ИмяМетаданныхОбъектаБД(ВидДокумента);
	ТипОграничения.Добавить(Тип(ИмяДанных));
	
	Возврат   ТипОграничения;
	
КонецФункции // ()   

// Процедура - заполняет признаки файлов объектов подтверждающих документов 
//
// Параметры:
//  Объект	 - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств	- заявка в которой выводим подтверждающие документы
//
Процедура ЗаполнитьПризнакиФайловОбъектов(Объект)  Экспорт

	Запрос = Новый Запрос(          
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявка.ВидДокумента КАК ВидДокумента,
	| 	Заявка.Файл КАК Файл
	| ПОМЕСТИТЬ ВТЗаявка
	|ИЗ
	|	&ПодтверждающиеДокументы КАК Заявка
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявка.ВидДокумента КАК ВидДокумента,
	|	ЕСТЬNULL(Заявка.ВидДокумента.ПрисоединенныйФайл, ЛОЖЬ) КАК ПрисоединенныйФайл,
	|	ЕСТЬNULL(Заявка.ВидДокумента.ОбъектСистемы, ЛОЖЬ) КАК ОбъектСистемы,
	|	ВЫБОР
	|		КОГДА Заявка.Файл.ПодписанЭП
	|				И Заявка.Файл.Зашифрован
	|			ТОГДА 2
	|		КОГДА Заявка.Файл.Зашифрован
	|			ТОГДА 1
	|		КОГДА Заявка.Файл.ПодписанЭП
	|			ТОГДА 0
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
	|	ВЫБОР
	|		КОГДА Заявка.Файл.ПометкаУдаления = ИСТИНА
	|			ТОГДА ЕСТЬNULL(Заявка.Файл.ИндексКартинки, 2) + 1
	|		ИНАЧЕ ЕСТЬNULL(Заявка.Файл.ИндексКартинки, 2)
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	ВТЗаявка КАК Заявка
	|");
    Запрос.УстановитьПараметр("ПодтверждающиеДокументы", Объект.ПодтверждающиеДокументыУХ.Выгрузить());

	Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого Стр Из Объект.ПодтверждающиеДокументыУХ Цикл
		Если Выборка.НайтиСледующий(Стр.ВидДокумента, "ВидДокумента") Тогда
			
			Стр.НаличиеФайла 						= Выборка.ПрисоединенныйФайл;
			Стр.НаличиеОбъекта 						= Выборка.ОбъектСистемы;    
			Стр.ИндексКартинки 						= Выборка.ИндексКартинки;    
			Стр.НомерКартинкиПодписанЗашифрован 	= Выборка.НомерКартинкиПодписанЗашифрован;    
	           
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры     

// Процедура - Установить основное оформление табличной части ПодтверждающиеДокументы заявки
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма документа ЗаявкаНаРасходованиеДенежныхСредств
//
Процедура УстановитьОсновноеОформлениеЗаявки(Форма) Экспорт
	
		ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПодтверждающиеДокументыУХФайл");
		
		//
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ЭлементУО.Отбор,
			"Объект.ПодтверждающиеДокументыУХ.НаличиеФайла", 
			ВидСравненияКомпоновкиДанных.Равно,Ложь,,Истина);
		//
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",					НСтр("ru = '<Не используется>'"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",			Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",	Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",				ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		
	    ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПодтверждающиеДокументыУХОбъектСистемы");
		
		//
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ЭлементУО.Отбор,
			"Объект.ПодтверждающиеДокументыУХ.НаличиеОбъекта", 
			ВидСравненияКомпоновкиДанных.Равно,Ложь,,Истина);
		//
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",					НСтр("ru = '<Не используется>'"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",			Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",	Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",				ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
   
КонецПроцедуры

// Функция - Получение массива пропущенных видов подтверждающих документов
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств	 - заявка , которая проверяется
// 
// Возвращаемое значение:
//   - 
//
Функция ПропущенныеВидыПодтверждающихДокументов(ДокументОбъект) Экспорт

	МассивВидов = РегистрыСведений.ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидыПодтверждающихДокументовОбязательные(ДокументОбъект.ВидОперацииУХ);
	
	МассивПропущенныхВидов = Новый Массив;
		
	Для каждого МассивВидовЭлемент Из МассивВидов Цикл
		Если  ДокументОбъект.ПодтверждающиеДокументыУХ.НайтиСтроки(Новый Структура("ВидДокумента", МассивВидовЭлемент)).Количество() <> 0  Тогда
			Продолжить;  				
		КонецЕсли;	
		МассивПропущенныхВидов.Добавить(МассивВидовЭлемент);
	КонецЦикла; 
	
	Возврат  МассивПропущенныхВидов;
	
КонецФункции // () 

// Процедура - Обработка проверки заполнения табличной части ПодтверждающиеДокументы заявки 
//
// Параметры:
//  ДокументОбъект	 - 	ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств - заявка
//  Отказ			 - 	Отказ 
//
Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодтверждающиеДокументы") Тогда
		Возврат;	                                                                          
	КонецЕсли;
	ПроверитьПропущенныеВидыЗаявки(ДокументОбъект, Отказ);	
	ПроверитьЗаполнениеПодтверждающихДокументов(ДокументОбъект, Отказ);

КонецПроцедуры

// Процедура - Заполнить виды подтверждающих документов
//
// Параметры:
//  ДокументОбъект			 - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств - заявка
//  ЗаполнятьРеквизитыФормы	 - Булево	 - признак заполнения реквизитов формы
//
Процедура ЗаполнитьВидыПодтверждающихДокументов(ДокументОбъект, ЗаполнятьРеквизитыФормы = Истина) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодтверждающиеДокументы") Тогда
		Возврат;	                                                                          
	КонецЕсли;

	Запрос 			= Новый Запрос;
	Запрос.Текст	= 
		"ВЫБРАТЬ
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидОперацииУХ КАК ВидОперацииУХ,
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидПодтверждающегоДокумента КАК ВидПодтверждающихДокументов,
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.Обязателен КАК Обязателен,
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидПодтверждающегоДокумента.ПрисоединенныйФайл КАК ПрисоединенныйФайл,
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидПодтверждающегоДокумента.ОбъектСистемы КАК ОбъектСистемы
		|ИЗ
		|	РегистрСведений.ВидыПодтверждающихДокументовПоВидамОперацийУХ КАК ВидыПодтверждающихДокументовПоВидамОперацийУХ
		|ГДЕ
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидОперацииУХ = &ВидОперацииУХ";
	
	Запрос.УстановитьПараметр("ВидОперацииУХ", ДокументОбъект.ВидОперацииУХ);
	
	РезультатЗапроса 					= Запрос.Выполнить();
	
	НовыеВидыПодтверждающихДокументов 	= РезультатЗапроса.Выгрузить();
	
	МассивУдаления = Новый Массив;
	
	Для каждого СтрокаПодтверждающиеДокументы Из ДокументОбъект.ПодтверждающиеДокументыУХ  Цикл
	
		Если НовыеВидыПодтверждающихДокументов.НайтиСтроки(Новый Структура("ВидПодтверждающихДокументов", СтрокаПодтверждающиеДокументы.ВидДокумента)).Количество() = 0  Тогда
			
			МассивУдаления.Добавить(СтрокаПодтверждающиеДокументы);			
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для каждого МассивУдаленияЭлемент Из  МассивУдаления Цикл
  		ДокументОбъект.ПодтверждающиеДокументыУХ.Удалить(МассивУдаленияЭлемент);
	КонецЦикла; 
	
	Для каждого СтрокаТЗ Из НовыеВидыПодтверждающихДокументов Цикл
		Если  ДокументОбъект.ПодтверждающиеДокументыУХ.НайтиСтроки(Новый Структура("ВидДокумента", СтрокаТЗ.ВидПодтверждающихДокументов)).Количество() <> 0  Тогда
			Продолжить;  				
		КонецЕсли;	
		
		СтрокаЗаявка 									= ДокументОбъект.ПодтверждающиеДокументыУХ.Добавить();
		СтрокаЗаявка.ВидДокумента  						= СтрокаТЗ.ВидПодтверждающихДокументов; 
		Если ЗаполнятьРеквизитыФормы Тогда
			СтрокаЗаявка.НаличиеФайла 						= СтрокаТЗ.ПрисоединенныйФайл;
			СтрокаЗаявка.НаличиеОбъекта 					= СтрокаТЗ.ОбъектСистемы;    
			СтрокаЗаявка.ИндексКартинки 					= 2;  
			СтрокаЗаявка.НомерКартинкиПодписанЗашифрован	= -1;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры  

// Процедура - Перенести обнаруженные файлы в заявке из присоединенных файлов
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств	 - заявка
//
Процедура ПеренестиОбнаруженныеФайлы(ДокументОбъект) Экспорт
	     	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаФайлы.ВладелецФайла КАК ВладелецФайла,
		|	ЗаявкаФайлы.Ссылка КАК Файл,
		|	ВЫБОР
		|		КОГДА ЗаявкаФайлы.ПодписанЭП
		|				И ЗаявкаФайлы.Зашифрован
		|			ТОГДА 2
		|		КОГДА ЗаявкаФайлы.Зашифрован
		|			ТОГДА 1
		|		КОГДА ЗаявкаФайлы.ПодписанЭП
		|			ТОГДА 0
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
		|	ВЫБОР
		|		КОГДА ЗаявкаФайлы.ПометкаУдаления = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ЗаявкаФайлы.ИндексКартинки, 2) + 1
		|		ИНАЧЕ ЕСТЬNULL(ЗаявкаФайлы.ИндексКартинки, 2)
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы КАК ЗаявкаФайлы
		|ГДЕ
		|	ЗаявкаФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ДокументОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ДокументОбъект.ПодтверждающиеДокументыУХ.НайтиСтроки(Новый Структура("Файл", ВыборкаДетальныеЗаписи.Файл)).Количество() <> 0  Тогда
			Продолжить;  				
		КонецЕсли;	 
					
		СтрокаЗаявка 									= ДокументОбъект.ПодтверждающиеДокументыУХ.Добавить();
		СтрокаЗаявка.ВидДокумента  						= Справочники.ВидыПодтверждающихДокументовУХ.ПроизвольныйФайл; 
		СтрокаЗаявка.НаличиеФайла 						= Истина;
		СтрокаЗаявка.НаличиеОбъекта 					= Ложь;    
		СтрокаЗаявка.ИндексКартинки 					= ВыборкаДетальныеЗаписи.ИндексКартинки;  
		СтрокаЗаявка.Файл 								= ВыборкаДетальныеЗаписи.Файл;  
		СтрокаЗаявка.НомерКартинкиПодписанЗашифрован	= ВыборкаДетальныеЗаписи.НомерКартинкиПодписанЗашифрован;  
		
	КонецЦикла;

КонецПроцедуры

// Функция - Проверка есть ли не используемые файлы в заявке
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств	 - заявка
// 
// Возвращаемое значение:
//   - 
//
Функция ЕстьНеИспользуемыеФайлы(ДокументОбъект)  Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаФайлы.Ссылка КАК Файл,
		|	ЗаявкаФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы КАК ЗаявкаФайлы
		|ГДЕ
		|	ЗаявкаФайлы.ВладелецФайла = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПризнакЕстьНеИспользуемыеФайлы = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ДокументОбъект.ПодтверждающиеДокументыУХ.НайтиСтроки(Новый Структура("Файл", ВыборкаДетальныеЗаписи.Файл)).Количество() <> 0  Тогда
			Продолжить;  				
		КонецЕсли;
		
		ПризнакЕстьНеИспользуемыеФайлы = Истина;
		
	КонецЦикла; 
	
	Возврат ПризнакЕстьНеИспользуемыеФайлы;

КонецФункции

// УХ_Встраивание ++ 
Процедура ОбщиеДоработкиФормыЗаявки(Форма, Элементы, ПараметрыЭлементов)  Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодтверждающиеДокументы") Тогда
		Возврат;	                                                                          
	КонецЕсли;      
	
	Элементы["СтраницаПодтверждающиеДокументы"].Заголовок = НСтр("ru = 'Подтверждающие документы ГОЗ'"); 
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("ПутьКДаннымЗаголовка", 	"Объект.ПодтверждающиеДокументыУХ.КоличествоСтрок");
	СтраницаПодтверждающиеДокументыУХ = ФормыУХ.СоздатьГруппуФормы(Элементы, "СтраницаПодтверждающиеДокументыУХ", 
		НСтр("ru = 'Подтверждающие документы'"), ВидГруппыФормы.Страница, Элементы.ГруппаСтраницы, Элементы.СтраницаРаспределениеПоСчетам, ПараметрыЭлемента); 
		
	ЭлементПодтверждающиеДокументыУХ = ФормыУХ.СоздатьТаблицуФормы(Элементы, "ПодтверждающиеДокументыУХ", ,"Объект.ПодтверждающиеДокументыУХ", СтраницаПодтверждающиеДокументыУХ);
		
	ГруппаОбнаруженныеФайлы = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаОбнаруженныеФайлы",,, 
		Элементы.СтраницаПодтверждающиеДокументыУХ, ЭлементПодтверждающиеДокументыУХ, ПараметрыЭлементов.ГруппаГ);
		
	Элемент = ФормыУХ.СоздатьДекорациюФормы(Элементы, "ДекорацияФайлы", НСтр("ru = 'Обнаружены присоединенные файлы, не используемые как подтверждающие документы'"),, 
		ГруппаОбнаруженныеФайлы, ,,);   
		
	ИмяКоманды = "ПеренестиОбнаруженныеФайлы";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Перенести'"), "Подключаемый_ПеренестиОбнаруженныеФайлы");										
	ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, ГруппаОбнаруженныеФайлы);
	
	ИмяКоманды = "ОбщаяКомандаПрисоединенныеФайлыУХ";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Открыть список'"), "Подключаемый_ОбщаяКомандаПрисоединенныеФайлыУХ",БиблиотекаКартинок.Прикрепить, ОтображениеКнопки.КартинкаИТекст);										
	ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, ГруппаОбнаруженныеФайлы);
			
	ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХНомерСтроки",, 
		"Объект.ПодтверждающиеДокументыУХ.НомерСтроки",, ЭлементПодтверждающиеДокументыУХ);	 
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("БыстрыйВыбор", 	Ложь);
	ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХВидДокумента",, 
		"Объект.ПодтверждающиеДокументыУХ.ВидДокумента",, ЭлементПодтверждающиеДокументыУХ,,ПараметрыЭлемента);		
	ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХНомер",, 
		"Объект.ПодтверждающиеДокументыУХ.Номер",, ЭлементПодтверждающиеДокументыУХ);		
	ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХДата",, 
		"Объект.ПодтверждающиеДокументыУХ.Дата",, ЭлементПодтверждающиеДокументыУХ);		
	ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХСумма",, 
		"Объект.ПодтверждающиеДокументыУХ.Сумма",, ЭлементПодтверждающиеДокументыУХ);		
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("КартинкаЗначений", 	БиблиотекаКартинок.ПодписанЗашифрованСостояния);
	ПараметрыЭлемента.Вставить("КартинкаШапки", 	БиблиотекаКартинок.ПодписанЗашифрованЗаголовок);
	ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХНомерКартинкиПодписанЗашифрован",, 
		"Объект.ПодтверждающиеДокументыУХ.НомерКартинкиПодписанЗашифрован", ВидПоляФормы.ПолеКартинки, ЭлементПодтверждающиеДокументыУХ,, ПараметрыЭлемента);		
			
	ИмяКоманды = "ЗаполнитьПодтверждающиеДокументыУХ";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Заполнить'"), "Подключаемый_ЗаполнитьПодтверждающиеДокументыУХ");										
	Элемент = ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, Элементы.ПодтверждающиеДокументыУХ.КоманднаяПанель);

	ИмяКоманды = "РедактироватьУХ";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Редактировать'"), "Подключаемый_РедактироватьУХ", БиблиотекаКартинок.РедактироватьФайл, ОтображениеКнопки.КартинкаИТекст);										
	Элемент = ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, Элементы.ПодтверждающиеДокументыУХ.КоманднаяПанель);
	
	ПодтверждающиеДокументыГруппаФайла = ФормыУХ.СоздатьГруппуФормы(Элементы, "ПодтверждающиеДокументыУХГруппаФайла",,ВидГруппыФормы.ГруппаКолонок, 
		Элементы.ПодтверждающиеДокументыУХ);
    ПодтверждающиеДокументыГруппаФайла.Группировка =  ГруппировкаКолонок.ВЯчейке;
	
	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХИндексКартинки", НСтр("ru = 'Индекс'"), "Объект.ПодтверждающиеДокументыУХ.ИндексКартинки",	ВидПоляФормы.ПолеКартинки, 
		ПодтверждающиеДокументыГруппаФайла, , ,);
	Элемент.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;      
	Элемент.КартинкаЗначений	    = БиблиотекаКартинок.КоллекцияПиктограммФайлов;
	

	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХФайл", НСтр("ru = 'Файл документа'"), "Объект.ПодтверждающиеДокументыУХ.Файл",, 
		ПодтверждающиеДокументыГруппаФайла, , ПараметрыЭлементов.ПолеВвода28,Новый Структура("НачалоВыбора", "Подключаемый_НачалоВыбораФайлУХ"));  
	Элемент.КнопкаВыбора	    	= Истина;	
	Элемент.КнопкаОчистки	    	= Истина;	
	Элемент.КнопкаВыпадающегоСписка	= Ложь;
	Элемент.ИсторияВыбораПриВводе	= ИсторияВыбораПриВводе.НеИспользовать;
	Элемент.КнопкаСоздания			= Ложь;   
	Элемент.ОтображениеКнопкиВыбора	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода; 
	Элемент.БыстрыйВыбор 			= Ложь;
	Элемент.РедактированиеТекста	= Ложь;

	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХНомерКартинкиПодписанЗашифрован", НСтр("ru = 'Подпись'"), "Объект.ПодтверждающиеДокументыУХ.НомерКартинкиПодписанЗашифрован",
		ВидПоляФормы.ПолеКартинки, Элементы.ПодтверждающиеДокументыУХ, ПодтверждающиеДокументыГруппаФайла);
  	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;  
	Элемент.КартинкаЗначений		   = БиблиотекаКартинок.ПодписанЗашифрованСостояния;
	Элемент.КартинкаШапки			   = БиблиотекаКартинок.ПодписанЗашифрованЗаголовок;  
	Элемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Лево;
	
	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ПодтверждающиеДокументыУХОбъектСистемы", НСтр("ru = 'Объект системы'"), "Объект.ПодтверждающиеДокументыУХ.ОбъектСистемы",, 
		Элементы.ПодтверждающиеДокументыУХ, , ПараметрыЭлементов.ПолеВвода28,Новый Структура("НачалоВыбора", "Подключаемый_ОбъектСистемыНачалоВыбора"));
		
	// Подменю Печать	
	ПодменюПечатьПодтверждающиеДокументы = ФормыУХ.СоздатьГруппуФормы(Элементы, "ПодменюПечатьПодтверждающиеДокументыУХ",НСтр("ru = 'Печать'"),ВидГруппыФормы.Подменю, 
			Элементы.ПодтверждающиеДокументыУХ.КоманднаяПанель); 
			
	ИмяКоманды = "ПечатьПодтверждающиеДокументы";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Сразу на принтер'"), "Подключаемый_ПечатьПодтверждающиеДокументы", БиблиотекаКартинок.Печать, ОтображениеКнопки.КартинкаИТекст);										
	Элемент = ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, ПодменюПечатьПодтверждающиеДокументы);
	
	// Подменю ЭЦП
	ПодменюКомандЭлектроннаяПодпись = ФормыУХ.СоздатьГруппуФормы(Элементы, "ПодменюКомандЭлектроннаяПодпись",НСтр("ru = 'Электронная подпись и шифрование'"),ВидГруппыФормы.Подменю, 
			Элементы.ПодтверждающиеДокументыУХ.КоманднаяПанель);                                                                                            
	ПодменюКомандЭлектроннаяПодпись.Картинка = БиблиотекаКартинок.ПодписанЗашифрованЗаголовок;

	ИмяКоманды = "ПодписатьУХ";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Подписать'"), "Подключаемый_ПодписатьУХ", БиблиотекаКартинок.ПодписанЭП, ОтображениеКнопки.КартинкаИТекст);										
	Элемент = ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, ПодменюКомандЭлектроннаяПодпись);
	
	ИмяКоманды = "ЗашифроватьУХ";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Зашифровать'"), "Подключаемый_ЗашифроватьУХ", БиблиотекаКартинок.Зашифрован, ОтображениеКнопки.КартинкаИТекст);										
	Элемент = ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, ПодменюКомандЭлектроннаяПодпись);
	
	ИмяКоманды = "РасшифроватьУХ";
	ФормыУХ.СоздатьКоманду(Форма, ИмяКоманды, НСтр("ru = 'Расшифровать'"), "Подключаемый_РасшифроватьУХ");										
	Элемент = ФормыУХ.СоздатьКнопкуФормы(Элементы, ИмяКоманды, "", ИмяКоманды, ВидКнопкиФормы.ОбычнаяКнопка, ПодменюКомандЭлектроннаяПодпись);

	Элементы.ПодтверждающиеДокументыУХ.УстановитьДействие("ПриОкончанииРедактирования",	"Подключаемый_ПодтверждающиеДокументыПриОкончанииРедактированияУХ");
	Элементы.ПодтверждающиеДокументыУХ.УстановитьДействие("ПослеУдаления",				"ПодтверждающиеДокументыПослеУдаленияУХ");
	
КонецПроцедуры                                                 

Процедура ЗаполнитьНастройкиПолейФормыЛокализация(Настройки) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодтверждающиеДокументы") Тогда
		Возврат;	                                                                          
	КонецЕсли;

	// Убираем привязку "Подтверждающих документов" к 275-ФЗ
	//ФормыУХ.УдалитьНастройкиПоля(Настройки, "ПодтверждающиеДокументы", "Видимость");
	//
	//Настройка = Настройки.Добавить();
	//Настройка.Поля.Добавить("ПодтверждающиеДокументыУХФайл");
	//ФормыУХ.НовыйОтбор(Настройка.Условие, "Дополнительно.Истина", Ложь);
	//Настройка.Свойства.Вставить("Видимость");
	
	//Настройка = Настройки.Добавить();
	//Настройка.Поля.Добавить("ГруппаОбнаруженныеФайлы");
	//ФормыУХ.НовыйОтбор(Настройка.Условие, "Дополнительно.ЕстьНеИспользуемыеФайлы", Истина);
	//Настройка.Свойства.Вставить("Видимость");

КонецПроцедуры

Процедура ОбщиеДоработкиФормыВидыПодтверждающихДокументов(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодтверждающиеДокументы") Тогда
		Возврат;	                                                                          
	КонецЕсли;

	Элементы = Форма.Элементы;
	
	ПараметрыЭлементов = ФормыУХ.ПолучитьПараметрыЭлементовПоУмолчанию();
	ПараметрыЭлементов.ГруппаВ.ОтображатьЗаголовок  = Ложь;
	ПараметрыЭлементов.ГруппаГ.ОтображатьЗаголовок  = Ложь;
	
	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ПрисоединенныйФайл", НСтр("ru = 'Присоединенный файл'"), "Объект.ПрисоединенныйФайл",	ВидПоляФормы.ПолеФлажка, 
		,,ПараметрыЭлементов.ПолеФлажка);

	ГруппаТипаДокумента = ФормыУХ.СоздатьГруппуФормы(Элементы, "ГруппаТипаДокумента",,,,,ПараметрыЭлементов.ГруппаГ);
	
	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ОбъектСистемы", НСтр("ru = 'Объект системы'"), "Объект.ОбъектСистемы",	ВидПоляФормы.ПолеФлажка, 
		ГруппаТипаДокумента,, ПараметрыЭлементов.ПолеФлажка,Новый Структура("ПриИзменении", "Подключаемый_ОбъектСистемыПриИзменении"));

	Элемент = ФормыУХ.СоздатьПолеФормы(Элементы, "ОбъектБД", НСтр("ru = 'Объект системы'"), "Объект.ОбъектБД",	ВидПоляФормы.ПолеВвода, 
		ГруппаТипаДокумента,,);
		
КонецПроцедуры


// УХ_Встраивание --
#КонецОбласти  

 #Область  СлужебныеПроцедурыИФункции
Процедура ПроверитьПропущенныеВидыЗаявки(ДокументОбъект, Отказ) 
	
	МассивПропущенныхВидов = ПропущенныеВидыПодтверждающихДокументов(ДокументОбъект);
	Для каждого МассивЭлемент Из МассивПропущенныхВидов Цикл
		ШаблонСообщения = НСтр("ru = 'Отсутствует обязательный вид подтверждающих документов %1.'");
		ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, МассивЭлемент);
		ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения, ДокументОбъект, "ПодтверждающиеДокументыУХ", "Объект", Отказ);
	КонецЦикла;  
	
КонецПроцедуры	

Процедура ПроверитьЗаполнениеПодтверждающихДокументов(ДокументОбъект, Отказ) 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заявка.Файл КАК Файл,  
		|	Заявка.НомерСтроки КАК НомерСтроки,
		|	Заявка.ОбъектСистемы КАК ОбъектСистемы,
		|	Заявка.ВидДокумента КАК ВидДокумента 
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	&ПодтверждающиеДокументы КАК Заявка
		|
        |;
		|ВЫБРАТЬ
   		|	Заявка.Файл КАК Файл, 
		|	Заявка.НомерСтроки КАК НомерСтроки,
		|	Заявка.ОбъектСистемы КАК ОбъектСистемы,
		|	ЕстьNULL(Заявка.ВидДокумента.ПрисоединенныйФайл, ЛОЖЬ) КАК ВидДокументаПрисоединенныйФайл,
		|	ЕстьNULL(Заявка.ВидДокумента.ОбъектСистемы, ЛОЖЬ) КАК ВидДокументаОбъектСистемы,
		|	Заявка.ВидДокумента КАК ВидДокумента    
		|ИЗ
		|	ВТДокументы КАК Заявка
		|	Левое соединение РегистрСведений.ВидыПодтверждающихДокументовПоВидамОперацийУХ КАК ВидыПодтверждающихДокументовПоВидамОперацийУХ
		|		ПО ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидПодтверждающегоДокумента = Заявка.ВидДокумента
		|		И ВидыПодтверждающихДокументовПоВидамОперацийУХ.ВидОперацииУХ = &ВидОперацииУХ
		|ГДЕ
		|	ВидыПодтверждающихДокументовПоВидамОперацийУХ.Обязателен";
    	
	Запрос.УстановитьПараметр("ПодтверждающиеДокументы", ДокументОбъект.ПодтверждающиеДокументыУХ.Выгрузить());
	Запрос.УстановитьПараметр("ВидОперацииУХ", ДокументОбъект.ВидОперацииУХ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидДокументаОбъектСистемы
			И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОбъектСистемы) Тогда 
			ТекущаяСтрока = СтрШаблон("ПодтверждающиеДокументыУХ[%1].ОбъектСистемы",ВыборкаДетальныеЗаписи.НомерСтроки-1);
			ШаблонСообщения = НСтр("ru = 'Не выбран объект для вида документа %1.'");
			ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ВыборкаДетальныеЗаписи.ВидДокумента);
			ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения, ДокументОбъект,
			        		ТекущаяСтрока, "Объект", Отказ);
   		КонецЕсли;  
		
		Если ВыборкаДетальныеЗаписи.ВидДокументаПрисоединенныйФайл
			И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Файл) Тогда 
			ТекущаяСтрока = СтрШаблон("ПодтверждающиеДокументыУХ[%1].Файл",ВыборкаДетальныеЗаписи.НомерСтроки-1);
			ШаблонСообщения = НСтр("ru = 'Не выбран файл для вида документа %1.'");
			ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,  ВыборкаДетальныеЗаписи.ВидДокумента);
			ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения, ДокументОбъект,
			        		ТекущаяСтрока, "Объект", Отказ);
 
		КонецЕсли;
 
	КонецЦикла;
КонецПроцедуры

Функция ИмяМетаданныхОбъектаБД(ВидДокумента) 

	 ОбъектБД 				= ОбщегоНазначенияУХ.ЗначениеРеквизитаОбъекта(ВидДокумента, "ОбъектБД");
	 Если ОбъектБД = Неопределено Тогда
	 	 Возврат Неопределено;
	 КонецЕсли; 
	 
	 ОбъектБДНаименование   = ОбщегоНазначенияУХ.ЗначениеРеквизитаОбъекта(ОбъектБД, 	"Наименование");
	 Если ТипЗнч(ОбъектБД) = Тип("СправочникСсылка.СправочникиБД") Тогда
		 Возврат "СправочникСсылка." + ОбъектБДНаименование;
	 Иначе
		 Возврат "ДокументСсылка." + ОбъектБДНаименование;
	 КонецЕсли; 
	
КонецФункции // ()

#КонецОбласти
